BenchmarkScripts/Datasize/results/memcached_5x6gb_1048576bsize.txt
Results for Memcached on port 11211:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            3.34          ---          ---        17.30311        15.99900        53.50300       589.82300      3420.48 
Gets           31.46         0.07        31.39         1.76163         0.39100        16.19100       454.65500         4.15 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals         34.80         0.07        31.39         2.90819         0.42300        25.34300       454.65500      3424.63 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.407        0.000
SET       1.359        5.000
SET       2.159       10.000
SET       3.727       15.000
SET       6.207       20.000
SET       8.703       25.000
SET      11.391       30.000
SET      12.863       35.000
SET      14.271       40.000
SET      15.295       45.000
SET      15.999       50.000
SET      16.255       52.500
SET      16.639       55.000
SET      17.151       57.500
SET      17.535       60.000
SET      17.919       62.500
SET      18.175       65.000
SET      18.559       67.500
SET      19.327       70.000
SET      19.967       72.500
SET      20.607       75.000
SET      20.863       76.250
SET      21.119       77.500
SET      21.375       78.750
SET      21.503       80.000
SET      21.631       81.250
SET      21.887       82.500
SET      22.015       83.750
SET      22.271       85.000
SET      22.399       86.250
SET      22.655       87.500
SET      22.783       88.125
SET      22.911       88.750
SET      23.039       89.375
SET      23.167       90.000
SET      23.423       90.625
SET      23.551       91.250
SET      23.679       91.875
SET      23.935       92.500
SET      24.063       93.125
SET      24.319       93.750
SET      24.447       94.062
SET      24.703       94.375
SET      24.959       94.688
SET      25.087       95.000
SET      25.215       95.312
SET      25.343       95.625
SET      25.471       95.938
SET      25.599       96.250
SET      25.855       96.562
SET      26.239       96.875
SET      26.367       97.031
SET      26.367       97.188
SET      26.623       97.344
SET      27.775       97.500
SET      27.903       97.656
SET      31.231       97.812
SET      31.871       97.969
SET      32.127       98.125
SET      32.255       98.281
SET      32.511       98.438
SET      33.535       98.516
SET      33.535       98.594
SET      35.839       98.672
SET      42.751       98.750
SET      43.007       98.828
SET      51.199       98.906
SET      53.503       98.984
SET      53.759       99.062
SET      74.751       99.141
SET      78.335       99.219
SET      78.847       99.258
SET      78.847       99.297
SET      79.359       99.336
SET     284.671       99.375
SET     284.671       99.414
SET     321.535       99.453
SET     321.535       99.492
SET     321.535       99.531
SET     321.535       99.570
SET     321.535       99.609
SET     321.535       99.629
SET     321.535       99.648
SET     325.631       99.668
SET     325.631       99.688
SET     325.631       99.707
SET     325.631       99.727
SET     325.631       99.746
SET     325.631       99.766
SET     509.951       99.785
SET     509.951       99.805
SET     509.951       99.814
SET     509.951       99.824
SET     589.823       99.834
SET     589.823       99.844
SET     589.823       99.854
SET     589.823       99.863
SET     589.823       99.873
SET     589.823       99.883
SET     716.799       99.893
SET     716.799      100.000
---
GET       0.015        0.000
GET       0.039        5.000
GET       0.055       10.000
GET       0.087       15.000
GET       0.159       20.000
GET       0.223       25.000
GET       0.287       30.000
GET       0.303       35.000
GET       0.319       40.000
GET       0.343       45.000
GET       0.391       50.000
GET       0.415       52.500
GET       0.423       55.000
GET       0.439       57.500
GET       0.455       60.000
GET       0.479       62.500
GET       0.495       65.000
GET       0.519       67.500
GET       0.551       70.000
GET       0.575       72.500
GET       0.631       75.000
GET       0.655       76.250
GET       0.679       77.500
GET       0.743       78.750
GET       0.775       80.000
GET       0.847       81.250
GET       0.895       82.500
GET       0.943       83.750
GET       1.015       85.000
GET       1.103       86.250
GET       1.183       87.500
GET       1.231       88.125
GET       1.255       88.750
GET       1.287       89.375
GET       1.351       90.000
GET       1.439       90.625
GET       1.503       91.250
GET       1.615       91.875
GET       1.767       92.500
GET       1.895       93.125
GET       2.095       93.750
GET       2.191       94.062
GET       2.271       94.375
GET       2.447       94.688
GET       2.543       95.000
GET       2.655       95.312
GET       2.831       95.625
GET       3.087       95.938
GET       3.375       96.250
GET       3.663       96.562
GET       4.223       96.875
GET       4.575       97.031
GET       5.055       97.188
GET       5.343       97.344
GET       5.535       97.500
GET       5.887       97.656
GET       6.271       97.812
GET       6.847       97.969
GET       7.519       98.125
GET       8.639       98.281
GET       9.919       98.438
GET       9.919       98.516
GET      10.495       98.594
GET      11.455       98.672
GET      12.287       98.750
GET      12.671       98.828
GET      13.887       98.906
GET      15.935       98.984
GET      18.175       99.062
GET      21.759       99.141
GET      24.575       99.219
GET      25.087       99.258
GET      25.599       99.297
GET      32.511       99.336
GET      35.071       99.375
GET      39.679       99.414
GET      44.543       99.453
GET      45.311       99.492
GET      46.591       99.531
GET      47.871       99.570
GET      52.223       99.609
GET      52.735       99.629
GET      52.991       99.648
GET      53.503       99.668
GET      55.295       99.688
GET      67.071       99.707
GET      67.583       99.727
GET      68.095       99.746
GET      71.679       99.766
GET     128.511       99.785
GET     129.023       99.805
GET     129.023       99.814
GET     129.023       99.824
GET     129.023       99.834
GET     305.151       99.844
GET     305.151       99.854
GET     305.151       99.863
GET     311.295       99.873
GET     454.655       99.883
GET     454.655       99.893
GET     454.655       99.902
GET     454.655       99.907
GET     454.655       99.912
GET     454.655       99.917
GET     454.655       99.922
GET     454.655       99.927
GET     454.655       99.932
GET     454.655       99.937
GET     458.751       99.941
GET     458.751       99.946
GET     458.751       99.951
GET     458.751       99.954
GET     458.751       99.956
GET     458.751       99.958
GET     458.751       99.961
GET     458.751       99.963
GET     458.751       99.966
GET     509.951       99.968
GET     509.951       99.971
GET     509.951       99.973
GET     509.951       99.976
GET     509.951       99.977
GET     598.015       99.978
GET     598.015       99.979
GET     598.015       99.980
GET     598.015       99.982
GET     618.495       99.983
GET     618.495      100.000
---
WAIT      0.000      100.000


Results for Memcached on port 11213:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           41.46          ---          ---        47.42641        27.77500       532.47900       888.83100     42456.04 
Gets          412.22         1.29       410.93         2.23977         0.83100        18.17500        61.69500        74.87 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        453.68         1.29       410.93         6.17501         0.95100        99.32700       614.39900     42530.91 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.439        0.000
SET       3.647        5.000
SET       5.535       10.000
SET       8.127       15.000
SET      11.391       20.000
SET      15.551       25.000
SET      18.687       30.000
SET      21.119       35.000
SET      23.423       40.000
SET      25.343       45.000
SET      27.775       50.000
SET      29.055       52.500
SET      30.591       55.000
SET      32.127       57.500
SET      33.791       60.000
SET      36.095       62.500
SET      38.655       65.000
SET      40.959       67.500
SET      43.007       70.000
SET      45.567       72.500
SET      48.639       75.000
SET      50.431       76.250
SET      52.223       77.500
SET      54.271       78.750
SET      57.855       80.000
SET      62.719       81.250
SET      67.071       82.500
SET      73.727       83.750
SET      79.359       85.000
SET      84.991       86.250
SET      90.111       87.500
SET      92.671       88.125
SET      95.743       88.750
SET      98.815       89.375
SET     101.887       90.000
SET     104.959       90.625
SET     107.519       91.250
SET     110.591       91.875
SET     113.663       92.500
SET     116.223       93.125
SET     118.783       93.750
SET     121.343       94.062
SET     123.903       94.375
SET     125.951       94.688
SET     128.511       95.000
SET     130.047       95.312
SET     133.119       95.625
SET     135.167       95.938
SET     138.239       96.250
SET     141.311       96.562
SET     144.383       96.875
SET     146.431       97.031
SET     148.479       97.188
SET     151.551       97.344
SET     153.599       97.500
SET     158.719       97.656
SET     163.839       97.812
SET     171.007       97.969
SET     179.199       98.125
SET     190.463       98.281
SET     212.991       98.438
SET     260.095       98.516
SET     311.295       98.594
SET     331.775       98.672
SET     370.687       98.750
SET     489.471       98.828
SET     497.663       98.906
SET     532.479       98.984
SET     548.863       99.062
SET     618.495       99.141
SET     647.167       99.219
SET     655.359       99.258
SET     667.647       99.297
SET     679.935       99.336
SET     692.223       99.375
SET     704.511       99.414
SET     708.607       99.453
SET     712.703       99.492
SET     757.759       99.531
SET     843.775       99.570
SET     860.159       99.609
SET     864.255       99.629
SET     864.255       99.648
SET     864.255       99.668
SET     872.447       99.688
SET     872.447       99.707
SET     872.447       99.727
SET     872.447       99.746
SET     876.543       99.766
SET     876.543       99.785
SET     876.543       99.805
SET     884.735       99.814
SET     888.831       99.824
SET     888.831       99.834
SET     888.831       99.844
SET     888.831       99.854
SET     888.831       99.863
SET     888.831       99.873
SET     888.831       99.883
SET     888.831       99.893
SET     888.831       99.902
SET     888.831       99.907
SET     888.831       99.912
SET     888.831       99.917
SET     888.831       99.922
SET     888.831       99.927
SET     888.831       99.932
SET     888.831       99.937
SET     888.831       99.941
SET     888.831       99.946
SET     892.927       99.951
SET     892.927       99.954
SET     892.927       99.956
SET     892.927       99.958
SET     892.927       99.961
SET     892.927       99.963
SET     909.311       99.966
SET     921.599       99.968
SET     921.599       99.971
SET     962.559       99.973
SET     966.655       99.976
SET     966.655       99.977
SET     966.655       99.978
SET     970.751       99.979
SET     970.751       99.980
SET     970.751       99.982
SET     970.751       99.983
SET     970.751       99.984
SET     970.751       99.985
SET     970.751       99.987
SET     970.751       99.988
SET     970.751       99.988
SET     970.751       99.989
SET     970.751       99.990
SET     970.751       99.990
SET     970.751       99.991
SET     970.751       99.991
SET     970.751       99.992
SET     970.751       99.993
SET     974.847       99.993
SET     974.847       99.994
SET     974.847       99.994
SET     974.847       99.995
SET     974.847       99.995
SET     974.847       99.995
[...]
SET     974.847       99.996
SET     974.847       99.996
SET     974.847       99.996
SET     987.135       99.997
SET     987.135      100.000
---
GET       0.023        0.000
GET       0.143        5.000
GET       0.199       10.000
GET       0.247       15.000
GET       0.303       20.000
GET       0.375       25.000
GET       0.447       30.000
GET       0.535       35.000
GET       0.623       40.000
GET       0.727       45.000
GET       0.831       50.000
GET       0.895       52.500
GET       0.959       55.000
GET       1.031       57.500
GET       1.103       60.000
GET       1.191       62.500
GET       1.295       65.000
GET       1.407       67.500
GET       1.535       70.000
GET       1.679       72.500
GET       1.855       75.000
GET       1.943       76.250
GET       2.039       77.500
GET       2.143       78.750
GET       2.271       80.000
GET       2.415       81.250
GET       2.559       82.500
GET       2.735       83.750
GET       2.927       85.000
GET       3.119       86.250
GET       3.343       87.500
GET       3.487       88.125
GET       3.615       88.750
GET       3.759       89.375
GET       3.919       90.000
GET       4.079       90.625
GET       4.287       91.250
GET       4.479       91.875
GET       4.703       92.500
GET       4.991       93.125
GET       5.279       93.750
GET       5.471       94.062
GET       5.663       94.375
GET       5.855       94.688
GET       6.079       95.000
GET       6.335       95.312
GET       6.623       95.625
GET       6.943       95.938
GET       7.327       96.250
GET       7.775       96.562
GET       8.255       96.875
GET       8.575       97.031
GET       8.895       97.188
GET       9.343       97.344
GET       9.727       97.500
GET      10.239       97.656
GET      10.751       97.812
GET      11.391       97.969
GET      12.031       98.125
GET      12.863       98.281
GET      13.887       98.438
GET      14.399       98.516
GET      14.911       98.594
GET      15.487       98.672
GET      16.127       98.750
GET      16.639       98.828
GET      17.279       98.906
GET      18.047       98.984
GET      19.071       99.062
GET      19.839       99.141
GET      20.607       99.219
GET      20.863       99.258
GET      21.119       99.297
GET      21.375       99.336
GET      21.631       99.375
GET      21.887       99.414
GET      22.271       99.453
GET      23.039       99.492
GET      24.063       99.531
GET      24.831       99.570
GET      26.239       99.609
GET      26.623       99.629
GET      27.135       99.648
GET      27.647       99.668
GET      28.543       99.688
GET      29.439       99.707
GET      30.591       99.727
GET      30.975       99.746
GET      31.743       99.766
GET      33.023       99.785
GET      34.815       99.805
GET      35.839       99.814
GET      36.351       99.824
GET      38.655       99.834
GET      40.191       99.844
GET      41.471       99.854
GET      44.031       99.863
GET      48.895       99.873
GET      54.015       99.883
GET      57.343       99.893
GET      67.071       99.902
GET      85.503       99.907
GET     153.599       99.912
GET     161.791       99.917
GET     236.543       99.922
GET     292.863       99.927
GET     329.727       99.932
GET     348.159       99.937
GET     419.839       99.941
GET     442.367       99.946
GET     462.847       99.951
GET     507.903       99.954
GET     511.999       99.956
GET     511.999       99.958
GET     544.767       99.961
GET     552.959       99.963
GET     552.959       99.966
GET     581.631       99.968
GET     593.919       99.971
GET     614.399       99.973
GET     643.071       99.976
GET     704.511       99.977
GET     757.759       99.978
GET     757.759       99.979
GET     757.759       99.980
GET     782.335       99.982
GET     798.719       99.983
GET     835.583       99.984
GET     835.583       99.985
GET     835.583       99.987
GET     835.583       99.988
GET     835.583       99.988
GET     847.871       99.989
GET     847.871       99.990
GET     851.967       99.990
GET     860.159       99.991
GET     860.159       99.991
GET     860.159       99.992
GET     860.159       99.993
GET     905.215       99.993
GET     909.311       99.994
GET     909.311       99.994
GET     909.311       99.995
GET     909.311       99.995
GET     909.311       99.995
GET     937.983       99.995
GET     974.847       99.996
GET     974.847       99.996
GET    1040.383       99.996
GET    1040.383       99.997
GET    1040.383       99.997
GET    1040.383       99.997
[...]
GET    1040.383       99.998
GET    1040.383       99.998
GET    1040.383       99.998
[...]
GET    1040.383       99.999
GET    1040.383       99.999
GET    1040.383       99.999
[...]
GET    1044.479       99.999
GET    1044.479      100.000
---
WAIT      0.000      100.000


Results for Memcached on port 11212:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           33.43          ---          ---        51.14243        28.54300       452.60700       864.25500     34233.02 
Gets          331.86         1.16       330.71         2.26156         0.76700        15.93500       169.98300        51.69 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        365.29         1.16       330.71         6.44770         0.86300       100.35100       618.49500     34284.71 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.431        0.000
SET       6.943        5.000
SET       8.319       10.000
SET      10.111       15.000
SET      13.055       20.000
SET      16.511       25.000
SET      18.175       30.000
SET      19.967       35.000
SET      22.527       40.000
SET      25.471       45.000
SET      28.543       50.000
SET      30.847       52.500
SET      34.559       55.000
SET      37.887       57.500
SET      40.703       60.000
SET      44.031       62.500
SET      47.871       65.000
SET      51.455       67.500
SET      55.807       70.000
SET      60.159       72.500
SET      64.255       75.000
SET      67.583       76.250
SET      70.655       77.500
SET      73.215       78.750
SET      76.287       80.000
SET      78.847       81.250
SET      81.919       82.500
SET      84.479       83.750
SET      87.039       85.000
SET      90.623       86.250
SET      94.719       87.500
SET      96.255       88.125
SET      98.303       88.750
SET      99.839       89.375
SET     101.375       90.000
SET     103.423       90.625
SET     105.471       91.250
SET     108.031       91.875
SET     111.615       92.500
SET     114.175       93.125
SET     117.759       93.750
SET     118.783       94.062
SET     120.319       94.375
SET     122.367       94.688
SET     124.415       95.000
SET     125.951       95.312
SET     127.999       95.625
SET     132.095       95.938
SET     135.167       96.250
SET     139.263       96.562
SET     145.407       96.875
SET     151.551       97.031
SET     153.599       97.188
SET     157.695       97.344
SET     164.863       97.500
SET     166.911       97.656
SET     172.031       97.812
SET     178.175       97.969
SET     182.271       98.125
SET     195.583       98.281
SET     217.087       98.438
SET     294.911       98.516
SET     411.647       98.594
SET     425.983       98.672
SET     430.079       98.750
SET     436.223       98.828
SET     446.463       98.906
SET     452.607       98.984
SET     456.703       99.062
SET     468.991       99.141
SET     585.727       99.219
SET     618.495       99.258
SET     626.687       99.297
SET     638.975       99.336
SET     638.975       99.375
SET     651.263       99.414
SET     651.263       99.453
SET     671.743       99.492
SET     684.031       99.531
SET     716.799       99.570
SET     741.375       99.609
SET     798.719       99.629
SET     798.719       99.648
SET     815.103       99.668
SET     819.199       99.688
SET     831.487       99.707
SET     831.487       99.727
SET     847.871       99.746
SET     847.871       99.766
SET     847.871       99.785
SET     856.063       99.805
SET     860.159       99.814
SET     860.159       99.824
SET     860.159       99.834
SET     860.159       99.844
SET     860.159       99.854
SET     860.159       99.863
SET     860.159       99.873
SET     860.159       99.883
SET     864.255       99.893
SET     864.255       99.902
SET     864.255       99.907
SET     864.255       99.912
SET     864.255       99.917
SET     864.255       99.922
SET     864.255       99.927
SET     868.351       99.932
SET     868.351       99.937
SET     868.351       99.941
SET     868.351       99.946
SET     942.079       99.951
SET     942.079       99.954
SET     942.079       99.956
SET     942.079       99.958
SET     942.079       99.961
SET     942.079       99.963
SET     942.079       99.966
SET     942.079       99.968
SET     942.079       99.971
SET     942.079       99.973
SET     942.079       99.976
SET     942.079       99.977
SET     942.079       99.978
SET     942.079       99.979
SET     942.079       99.980
SET     942.079       99.982
SET     942.079       99.983
SET     942.079       99.984
SET     942.079       99.985
SET     942.079       99.987
SET    1036.287       99.988
SET    1036.287      100.000
---
GET       0.023        0.000
GET       0.151        5.000
GET       0.199       10.000
GET       0.247       15.000
GET       0.327       20.000
GET       0.399       25.000
GET       0.463       30.000
GET       0.527       35.000
GET       0.599       40.000
GET       0.671       45.000
GET       0.767       50.000
GET       0.815       52.500
GET       0.871       55.000
GET       0.935       57.500
GET       1.015       60.000
GET       1.111       62.500
GET       1.223       65.000
GET       1.343       67.500
GET       1.479       70.000
GET       1.615       72.500
GET       1.783       75.000
GET       1.871       76.250
GET       1.967       77.500
GET       2.063       78.750
GET       2.175       80.000
GET       2.287       81.250
GET       2.431       82.500
GET       2.559       83.750
GET       2.719       85.000
GET       2.879       86.250
GET       3.071       87.500
GET       3.167       88.125
GET       3.279       88.750
GET       3.391       89.375
GET       3.519       90.000
GET       3.647       90.625
GET       3.791       91.250
GET       3.967       91.875
GET       4.159       92.500
GET       4.383       93.125
GET       4.639       93.750
GET       4.767       94.062
GET       4.927       94.375
GET       5.087       94.688
GET       5.311       95.000
GET       5.503       95.312
GET       5.727       95.625
GET       5.983       95.938
GET       6.271       96.250
GET       6.623       96.562
GET       7.007       96.875
GET       7.199       97.031
GET       7.487       97.188
GET       7.775       97.344
GET       8.063       97.500
GET       8.383       97.656
GET       8.767       97.812
GET       9.151       97.969
GET       9.727       98.125
GET      10.431       98.281
GET      11.263       98.438
GET      11.647       98.516
GET      12.159       98.594
GET      12.671       98.672
GET      13.183       98.750
GET      13.887       98.828
GET      14.783       98.906
GET      15.743       98.984
GET      16.895       99.062
GET      18.303       99.141
GET      19.583       99.219
GET      20.223       99.258
GET      20.607       99.297
GET      20.863       99.336
GET      21.119       99.375
GET      21.759       99.414
GET      22.527       99.453
GET      23.423       99.492
GET      24.703       99.531
GET      25.983       99.570
GET      27.519       99.609
GET      28.287       99.629
GET      30.207       99.648
GET      30.975       99.668
GET      31.999       99.688
GET      34.815       99.707
GET      36.351       99.727
GET      39.167       99.746
GET      40.959       99.766
GET      42.751       99.785
GET      48.383       99.805
GET      52.991       99.814
GET      57.599       99.824
GET      60.671       99.834
GET      62.975       99.844
GET      70.655       99.854
GET      75.263       99.863
GET     114.175       99.873
GET     118.271       99.883
GET     135.167       99.893
GET     221.183       99.902
GET     270.335       99.907
GET     321.535       99.912
GET     415.743       99.917
GET     489.471       99.922
GET     491.519       99.927
GET     589.823       99.932
GET     602.111       99.937
GET     606.207       99.941
GET     610.303       99.946
GET     610.303       99.951
GET     610.303       99.954
GET     614.399       99.956
GET     614.399       99.958
GET     618.495       99.961
GET     638.975       99.963
GET     675.839       99.966
GET     675.839       99.968
GET     675.839       99.971
GET     675.839       99.973
GET     679.935       99.976
GET     679.935       99.977
GET     679.935       99.978
GET     761.855       99.979
GET     761.855       99.980
GET     765.951       99.982
GET     765.951       99.983
GET     765.951       99.984
GET     765.951       99.985
GET     786.431       99.987
GET     786.431       99.988
GET     786.431       99.988
GET     786.431       99.989
GET     806.911       99.990
GET     806.911       99.990
GET     806.911       99.991
GET     806.911       99.991
GET     811.007       99.992
GET     811.007       99.993
GET     811.007       99.993
GET     811.007       99.994
GET     811.007       99.994
GET     811.007       99.995
GET     811.007       99.995
GET     811.007       99.995
[...]
GET     815.103       99.996
GET     815.103       99.996
GET     815.103       99.996
GET     815.103       99.997
GET     929.791       99.997
GET     929.791       99.997
GET     978.943       99.997
GET     978.943       99.997
GET     978.943       99.998
GET     978.943       99.998
GET     978.943       99.998
GET     983.039       99.998
GET     983.039       99.998
GET     983.039       99.998
[...]
GET     983.039       99.999
GET     983.039       99.999
GET     983.039       99.999
[...]
GET    1032.191       99.999
GET    1032.191      100.000
---
WAIT      0.000      100.000


Results for Memcached on port 11215:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           37.68          ---          ---        54.07031        45.05500       569.34300       987.13500     38581.26 
Gets          374.56         1.40       373.16         2.81879         1.35900        18.30300       100.86300        62.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        412.24         1.40       373.16         7.24973         1.55100       100.86300       622.59100     38643.88 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.375        0.000
SET       2.911        5.000
SET       3.695       10.000
SET       4.479       15.000
SET       5.247       20.000
SET       7.423       25.000
SET      11.967       30.000
SET      16.511       35.000
SET      22.655       40.000
SET      30.975       45.000
SET      45.055       50.000
SET      49.663       52.500
SET      54.271       55.000
SET      57.855       57.500
SET      60.415       60.000
SET      62.975       62.500
SET      66.559       65.000
SET      69.119       67.500
SET      72.191       70.000
SET      74.751       72.500
SET      77.311       75.000
SET      78.847       76.250
SET      80.383       77.500
SET      81.919       78.750
SET      83.967       80.000
SET      85.503       81.250
SET      87.551       82.500
SET      89.087       83.750
SET      91.135       85.000
SET      93.695       86.250
SET      96.255       87.500
SET      97.791       88.125
SET      99.327       88.750
SET     100.351       89.375
SET     101.887       90.000
SET     103.935       90.625
SET     105.471       91.250
SET     107.007       91.875
SET     108.543       92.500
SET     110.591       93.125
SET     113.151       93.750
SET     114.175       94.062
SET     116.223       94.375
SET     117.759       94.688
SET     119.807       95.000
SET     120.831       95.312
SET     122.367       95.625
SET     123.903       95.938
SET     125.951       96.250
SET     128.511       96.562
SET     132.095       96.875
SET     133.119       97.031
SET     135.167       97.188
SET     137.215       97.344
SET     141.311       97.500
SET     145.407       97.656
SET     149.503       97.812
SET     153.599       97.969
SET     156.671       98.125
SET     165.887       98.281
SET     169.983       98.438
SET     172.031       98.516
SET     175.103       98.594
SET     187.391       98.672
SET     250.879       98.750
SET     307.199       98.828
SET     425.983       98.906
SET     561.151       98.984
SET     589.823       99.062
SET     606.207       99.141
SET     614.399       99.219
SET     622.591       99.258
SET     630.783       99.297
SET     634.879       99.336
SET     643.071       99.375
SET     655.359       99.414
SET     663.551       99.453
SET     667.647       99.492
SET     675.839       99.531
SET     684.031       99.570
SET     692.223       99.609
SET     696.319       99.629
SET     696.319       99.648
SET     765.951       99.668
SET     770.047       99.688
SET     770.047       99.707
SET     774.143       99.727
SET     819.199       99.746
SET     839.679       99.766
SET     843.775       99.785
SET     851.967       99.805
SET     851.967       99.814
SET     856.063       99.824
SET     856.063       99.834
SET     970.751       99.844
SET     974.847       99.854
SET     978.943       99.863
SET     983.039       99.873
SET     983.039       99.883
SET     983.039       99.893
SET     987.135       99.902
SET     987.135       99.907
SET     991.231       99.912
SET     991.231       99.917
SET     991.231       99.922
SET     991.231       99.927
SET     991.231       99.932
SET    1023.999       99.937
SET    1028.095       99.941
SET    1028.095       99.946
SET    1032.191       99.951
SET    1032.191       99.954
SET    1032.191       99.956
SET    1032.191       99.958
SET    1032.191       99.961
SET    1044.479       99.963
SET    1044.479       99.966
SET    1044.479       99.968
SET    1044.479       99.971
SET    1044.479       99.973
SET    1044.479       99.976
SET    1044.479       99.977
SET    1044.479       99.978
SET    1044.479       99.979
SET    1044.479       99.980
SET    1044.479       99.982
SET    1044.479       99.983
SET    1048.575       99.984
SET    1048.575      100.000
---
GET       0.015        0.000
GET       0.207        5.000
GET       0.351       10.000
GET       0.487       15.000
GET       0.631       20.000
GET       0.711       25.000
GET       0.759       30.000
GET       0.855       35.000
GET       0.991       40.000
GET       1.175       45.000
GET       1.359       50.000
GET       1.463       52.500
GET       1.567       55.000
GET       1.687       57.500
GET       1.807       60.000
GET       1.935       62.500
GET       2.079       65.000
GET       2.207       67.500
GET       2.367       70.000
GET       2.511       72.500
GET       2.655       75.000
GET       2.735       76.250
GET       2.831       77.500
GET       2.943       78.750
GET       3.087       80.000
GET       3.231       81.250
GET       3.391       82.500
GET       3.599       83.750
GET       3.823       85.000
GET       4.127       86.250
GET       4.415       87.500
GET       4.543       88.125
GET       4.671       88.750
GET       4.831       89.375
GET       4.991       90.000
GET       5.183       90.625
GET       5.407       91.250
GET       5.567       91.875
GET       5.759       92.500
GET       5.951       93.125
GET       6.207       93.750
GET       6.303       94.062
GET       6.431       94.375
GET       6.591       94.688
GET       6.751       95.000
GET       6.975       95.312
GET       7.295       95.625
GET       7.679       95.938
GET       8.095       96.250
GET       8.639       96.562
GET       9.215       96.875
GET       9.471       97.031
GET       9.791       97.188
GET      10.111       97.344
GET      10.623       97.500
GET      11.071       97.656
GET      11.519       97.812
GET      12.095       97.969
GET      12.543       98.125
GET      13.183       98.281
GET      14.143       98.438
GET      14.591       98.516
GET      15.039       98.594
GET      15.487       98.672
GET      15.999       98.750
GET      16.639       98.828
GET      17.407       98.906
GET      18.175       98.984
GET      19.455       99.062
GET      20.479       99.141
GET      21.247       99.219
GET      21.887       99.258
GET      22.399       99.297
GET      23.039       99.336
GET      23.935       99.375
GET      24.831       99.414
GET      26.111       99.453
GET      27.135       99.492
GET      28.415       99.531
GET      29.695       99.570
GET      30.591       99.609
GET      31.103       99.629
GET      31.743       99.648
GET      32.255       99.668
GET      33.279       99.688
GET      34.047       99.707
GET      35.327       99.727
GET      37.119       99.746
GET      38.399       99.766
GET      39.935       99.785
GET      42.751       99.805
GET      43.519       99.814
GET      45.311       99.824
GET      47.103       99.834
GET      49.663       99.844
GET      51.711       99.854
GET      55.551       99.863
GET      63.743       99.873
GET      67.071       99.883
GET      79.871       99.893
GET     114.175       99.902
GET     115.711       99.907
GET     144.383       99.912
GET     227.327       99.917
GET     228.351       99.922
GET     288.767       99.927
GET     292.863       99.932
GET     292.863       99.937
GET     360.447       99.941
GET     430.079       99.946
GET     438.271       99.951
GET     466.943       99.954
GET     466.943       99.956
GET     544.767       99.958
GET     602.111       99.961
GET     643.071       99.963
GET     643.071       99.966
GET     643.071       99.968
GET     655.359       99.971
GET     700.415       99.973
GET     724.991       99.976
GET     724.991       99.977
GET     724.991       99.978
GET     729.087       99.979
GET     729.087       99.980
GET     733.183       99.982
GET     733.183       99.983
GET     802.815       99.984
GET     802.815       99.985
GET     802.815       99.987
GET     974.847       99.988
GET     974.847       99.988
GET     974.847       99.989
GET     974.847       99.990
GET     974.847       99.990
GET     978.943       99.991
GET     978.943       99.991
GET     978.943       99.992
GET     983.039       99.993
GET     983.039       99.993
GET    1015.807       99.994
GET    1015.807       99.994
GET    1015.807       99.995
GET    1015.807       99.995
GET    1015.807       99.995
[...]
GET    1015.807       99.996
GET    1015.807       99.996
GET    1015.807       99.996
GET    1040.383       99.997
GET    1040.383      100.000
---
WAIT      0.000      100.000


Results for Memcached on port 11214:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           28.68          ---          ---        70.95312        65.53500       360.44700       892.92700     29366.75 
Gets          284.18         1.40       282.78         3.79491         1.37500        22.39900       696.31900        53.95 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        312.86         1.40       282.78         9.35154         1.55900       133.11900       757.75900     29420.70 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.439        0.000
SET       2.927        5.000
SET       8.319       10.000
SET      14.847       15.000
SET      17.791       20.000
SET      20.223       25.000
SET      23.935       30.000
SET      34.559       35.000
SET      44.287       40.000
SET      55.551       45.000
SET      65.535       50.000
SET      68.607       52.500
SET      71.167       55.000
SET      73.215       57.500
SET      76.287       60.000
SET      79.359       62.500
SET      82.431       65.000
SET      84.991       67.500
SET      89.599       70.000
SET      93.183       72.500
SET      97.279       75.000
SET      98.815       76.250
SET     100.863       77.500
SET     102.911       78.750
SET     105.471       80.000
SET     107.519       81.250
SET     110.079       82.500
SET     113.151       83.750
SET     116.735       85.000
SET     119.807       86.250
SET     123.391       87.500
SET     125.439       88.125
SET     126.975       88.750
SET     129.023       89.375
SET     131.071       90.000
SET     133.119       90.625
SET     136.191       91.250
SET     139.263       91.875
SET     141.311       92.500
SET     143.359       93.125
SET     145.407       93.750
SET     147.455       94.062
SET     148.479       94.375
SET     151.551       94.688
SET     152.575       95.000
SET     155.647       95.312
SET     157.695       95.625
SET     161.791       95.938
SET     165.887       96.250
SET     171.007       96.562
SET     177.151       96.875
SET     180.223       97.031
SET     183.295       97.188
SET     187.391       97.344
SET     189.439       97.500
SET     190.463       97.656
SET     199.679       97.812
SET     210.943       97.969
SET     217.087       98.125
SET     242.687       98.281
SET     286.719       98.438
SET     321.535       98.516
SET     325.631       98.594
SET     327.679       98.672
SET     329.727       98.750
SET     331.775       98.828
SET     348.159       98.906
SET     360.447       98.984
SET     364.543       99.062
SET     428.031       99.141
SET     428.031       99.219
SET     430.079       99.258
SET     468.991       99.297
SET     557.055       99.336
SET     589.823       99.375
SET     622.591       99.414
SET     622.591       99.453
SET     647.167       99.492
SET     647.167       99.531
SET     659.455       99.570
SET     663.551       99.609
SET     696.319       99.629
SET     749.567       99.648
SET     749.567       99.668
SET     757.759       99.688
SET     757.759       99.707
SET     761.855       99.727
SET     761.855       99.746
SET     843.775       99.766
SET     847.871       99.785
SET     847.871       99.805
SET     847.871       99.814
SET     847.871       99.824
SET     847.871       99.834
SET     884.735       99.844
SET     884.735       99.854
SET     884.735       99.863
SET     884.735       99.873
SET     884.735       99.883
SET     884.735       99.893
SET     909.311       99.902
SET     909.311       99.907
SET     909.311       99.912
SET     909.311       99.917
SET     909.311       99.922
SET     909.311       99.927
SET     909.311       99.932
SET     974.847       99.937
SET     974.847       99.941
SET     974.847       99.946
SET     978.943       99.951
SET     978.943       99.954
SET     978.943       99.956
SET     978.943       99.958
SET     987.135       99.961
SET     987.135      100.000
---
GET       0.015        0.000
GET       0.207        5.000
GET       0.311       10.000
GET       0.407       15.000
GET       0.487       20.000
GET       0.583       25.000
GET       0.695       30.000
GET       0.855       35.000
GET       0.991       40.000
GET       1.167       45.000
GET       1.375       50.000
GET       1.479       52.500
GET       1.591       55.000
GET       1.695       57.500
GET       1.807       60.000
GET       1.927       62.500
GET       2.063       65.000
GET       2.207       67.500
GET       2.351       70.000
GET       2.511       72.500
GET       2.703       75.000
GET       2.799       76.250
GET       2.911       77.500
GET       3.023       78.750
GET       3.151       80.000
GET       3.279       81.250
GET       3.423       82.500
GET       3.583       83.750
GET       3.759       85.000
GET       3.935       86.250
GET       4.159       87.500
GET       4.287       88.125
GET       4.415       88.750
GET       4.543       89.375
GET       4.703       90.000
GET       4.895       90.625
GET       5.055       91.250
GET       5.247       91.875
GET       5.503       92.500
GET       5.727       93.125
GET       6.047       93.750
GET       6.239       94.062
GET       6.431       94.375
GET       6.655       94.688
GET       6.911       95.000
GET       7.263       95.312
GET       7.583       95.625
GET       7.935       95.938
GET       8.383       96.250
GET       8.831       96.562
GET       9.407       96.875
GET       9.791       97.031
GET      10.175       97.188
GET      10.623       97.344
GET      11.135       97.500
GET      11.711       97.656
GET      12.351       97.812
GET      13.183       97.969
GET      14.207       98.125
GET      15.487       98.281
GET      16.639       98.438
GET      17.407       98.516
GET      17.919       98.594
GET      18.687       98.672
GET      19.583       98.750
GET      20.735       98.828
GET      21.375       98.906
GET      22.143       98.984
GET      23.295       99.062
GET      25.343       99.141
GET      29.823       99.219
GET      31.103       99.258
GET      31.999       99.297
GET      32.639       99.336
GET      34.047       99.375
GET      35.583       99.414
GET      36.863       99.453
GET      40.703       99.492
GET      41.727       99.531
GET      46.079       99.570
GET      48.895       99.609
GET      51.711       99.629
GET      54.527       99.648
GET      61.439       99.668
GET      63.231       99.688
GET      73.215       99.707
GET      90.623       99.727
GET     115.199       99.746
GET     143.359       99.766
GET     290.815       99.785
GET     296.959       99.805
GET     301.055       99.814
GET     307.199       99.824
GET     368.639       99.834
GET     374.783       99.844
GET     487.423       99.854
GET     489.471       99.863
GET     540.671       99.873
GET     671.743       99.883
GET     684.031       99.893
GET     696.319       99.902
GET     700.415       99.907
GET     749.567       99.912
GET     778.239       99.917
GET     806.911       99.922
GET     827.391       99.927
GET     876.543       99.932
GET     917.503       99.937
GET     917.503       99.941
GET     917.503       99.946
GET     921.599       99.951
GET     921.599       99.954
GET     921.599       99.956
GET     921.599       99.958
GET     921.599       99.961
GET     921.599       99.963
GET     925.695       99.966
GET     925.695       99.968
GET     925.695       99.971
GET     925.695       99.973
GET     925.695       99.976
GET     925.695       99.977
GET     974.847       99.978
GET     974.847       99.979
GET     974.847       99.980
GET     974.847       99.982
GET     974.847       99.983
GET     974.847       99.984
GET     978.943       99.985
GET     978.943       99.987
GET     978.943       99.988
GET     978.943       99.988
GET     978.943       99.989
GET     983.039       99.990
GET     983.039       99.990
GET     983.039       99.991
GET     983.039       99.991
GET     983.039       99.992
GET     983.039       99.993
GET     987.135       99.993
GET     987.135       99.994
GET     987.135       99.994
GET     987.135       99.995
GET     987.135       99.995
GET     987.135       99.995
[...]
GET     987.135       99.996
GET     987.135       99.996
GET     987.135       99.996
GET     987.135       99.997
GET     987.135       99.997
GET     987.135       99.997
[...]
GET     987.135       99.998
GET     987.135       99.998
GET     987.135       99.998
GET     991.231       99.998
GET     991.231       99.998
GET     991.231       99.998
[...]
GET     991.231       99.999
GET     991.231       99.999
GET     991.231       99.999
[...]
GET    1007.615      100.000
GET    1007.615      100.000
---
WAIT      0.000      100.000